app/views/shopping_carts/show.haml

SELECT "in_shopping_carts".* FROM "in_shopping_carts" WHERE "in_shopping_carts"."shopping_cart_id" = ?  [["shopping_cart_id", 2]]
---
		%tbody
			-@shopping_cart.in_shopping_carts.each do |i_sh|