app/controllers/attachments_controller.rb

  def create
    @attachment = Attachment.new(attachment_params)
    if  @attachment.save
---
INSERT INTO "attachments" ("product_id", "file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @attachment.destroy
---
DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 1]]

    def set_attachment
      @attachment = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", 2]]