app/controllers/email_controller.rb

INSERT INTO "my_emails" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "miguel@hotmail.com"], ["created_at", "2016-08-29 00:24:47.139874"], ["updated_at", "2016-08-29 00:24:47.139874"]]
---
  def create
  	@email = MyEmail.new(email: params[:email])
  	if @email.save