app/controllers/in_shopping_carts_controller.rb

	def create
		in_shopping_cart = InShoppingCart.new(product_id: params[:product_id],
												shopping_cart: @shopping_cart)

		if in_shopping_cart.save
---
INSERT INTO "in_shopping_carts" ("product_id", "shopping_cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["shopping_cart_id", 2], ["created_at", "2016-09-04 19:51:48.597151"], ["updated_at", "2016-09-04 19:51:48.597151"]]