app/controllers/payments_controller.rb

INSERT INTO "my_payments" ("paypal_id", "ip", "shopping_cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["paypal_id", "PAY-41B61475KK387290VK7GLQDY"], ["ip", "127.0.0.1"], ["shopping_cart_id", 2], ["created_at", "2016-09-05 00:10:54.481790"], ["updated_at", "2016-09-05 00:10:54.481790"]]
---
	def create
	  	paypal_helper = Stores::Paypal.new(@shopping_cart.total,
	  										@shopping_cart.items,
	  										return_url: checkout_url,
	  										cancel_url: carrito_url
	  										)

		if paypal_helper.process_payment.create

SELECT  "my_payments".* FROM "my_payments" WHERE "my_payments"."paypal_id" = ? LIMIT 1  [["paypal_id", "PAY-41B61475KK387290VK7GLQDY"]]
---
	def checkout
		@my_payment = MyPayment.find_by(paypal_id: params[:paymentId])