app/controllers/products_controller.rb

INSERT INTO "products" ("name", "pricing", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hola"], ["pricing", 15000.0], ["description", "Soy nuevo"], ["user_id", 1], ["created_at", "2016-08-31 02:00:32.689883"], ["updated_at", "2016-08-31 02:00:32.689883"]]
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user
    respond_to do |format|
      if @product.save

UPDATE "products" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
  def update
    respond_to do |format|
      if @product.update(product_params)